Revit 2027 API
Element.ViewSpecific Property
 Identifies if the element is owned by a view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ViewSpecific { get; }
Public ReadOnly Property ViewSpecific As Boolean
	Get
public:
property bool ViewSpecific {
	bool get ();
}
member ViewSpecific : bool with get
Property Value
Boolean
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace